docs/articles/projectile_root.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs Projectile in a Monorepo</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/static/main.css" />
</head>
<body>
<div id="preamble" class="status">
<nav id="navbar" class="cf">
  <ul class="cf">
    <li class="fl">
      <a href="/">cfclrk</a>
    </li>
    <li class="fr">
      <a href="/articles/home.html">Articles</a>
    </li>
    <li class="fr">
      <a href="/notes/home.html">Notes</a>
    </li>
	<li class="fr">
      <a href="/cloudformation/home.html">CloudFormation</a>
    </li>
  </ul>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Emacs Projectile in a Monorepo</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgad67b2b">Two Kinds of Monorepos</a></li>
<li><a href="#org00c90ad">Example of the Problem</a></li>
<li><a href="#orgc84f9c5">About Projectile Project Detection</a></li>
<li><a href="#org8cc68d2">Updating <code>projectile-project-root-files-bottom-up</code></a></li>
<li><a href="#solution">Solution</a></li>
<li><a href="#orgc95fa59">Test</a>
<ul>
<li><a href="#org320ecfc">Go</a></li>
<li><a href="#org60dd335">Python</a></li>
<li><a href="#org1a4aece">Force Root Higher</a></li>
</ul>
</li>
</ul>
</div>
</nav>
<p>
In a monorepo, <a href="https://docs.projectile.mx/projectile/index.html">Projectile</a> determines the project root to be the <i>monorepo</i>, not
the subproject that you're currently in. In this article I update Projectile to
instead prioritize the most specific project it can find.
</p>

<p>
To jump to the solution, go to <a href="#solution">Solution</a>.
</p>

<div id="outline-container-orgad67b2b" class="outline-2">
<h2 id="orgad67b2b"><a href="#orgad67b2b">Two Kinds of Monorepos</a></h2>
<div class="outline-text-2" id="text-orgad67b2b">
<p>
I've seen two kinds of monorepos:
</p>

<ol class="org-ol">
<li><p>
A single git repository to hold several, self-contained projects.
</p>

<p>
In this case, the repo is basically a dumping ground for smaller projects.
The motivation here is to stave off an explosion of small repositories, and
to collect issues and PRs in one place where a team can review them.
</p></li>

<li><p>
A single git repository with common libraries and multiple independently
deployable services.
</p>

<p>
This is what the term "monorepo" is supposed to connote - a single commit
describes a working version of several services that may need to work
together and share code.
</p></li>
</ol>

<p>
Always in case 1, and sometimes in case 2, I would rather projectile consider
a subproject as a "project root". One could still use Projectile on the whole
monorepo by navigating to a file at the root of the monorepo.
</p>
</div>
</div>

<div id="outline-container-org00c90ad" class="outline-2">
<h2 id="org00c90ad"><a href="#org00c90ad">Example of the Problem</a></h2>
<div class="outline-text-2" id="text-org00c90ad">
<p>
Consider the following monorepo:
</p>

<div class="org-src-container">
<pre class="src src-sh">tree -F -a /tmp/repo
</pre>
</div>

<pre class="example" id="org92f4b88">
/tmp/repo/
├── .git
├── go/
│   ├── projectA/
│   │   └── go.mod
│   └── projectB/
│       └── go.mod
└── python/
    ├── projectC/
    │   └── setup.py
    └── projectD/
        └── setup.py

7 directories, 5 files
</pre>

<p>
Now when I open a file in <code>go/projectA</code>, Projectile says that the project root
is the monorepo:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #000000;">(</span><span style="color: #5317ac;">let</span> <span style="color: #a8007f;">(</span><span style="color: #005f88;">(</span>default-directory <span style="color: #2544bb;">"/tmp/repo/go/projectA"</span><span style="color: #005f88;">)</span><span style="color: #a8007f;">)</span>
  <span style="color: #a8007f;">(</span>projectile-project-root<span style="color: #a8007f;">)</span><span style="color: #000000;">)</span>
</pre>
</div>

<div class="results">#+RESULTS:</div><pre class="example">
/private/tmp/repo/
</pre>


<p>
(Don't worry about the <code>/private/</code> &#x2013; it's because MacOS symlinks <code>/tmp</code> →
<code>/private/tmp</code>).
</p>

<p>
I <i>want</i> Projectile to say that the project root is the Go subject:
<code>/tmp/repo/go/projectA</code>. But alas, Projectile instead found the monorepo root:
<code>/tmp/repo/</code>.
</p>

<p>
How does projectile determine that project root?
</p>
</div>
</div>

<div id="outline-container-orgc84f9c5" class="outline-2">
<h2 id="orgc84f9c5"><a href="#orgc84f9c5">About Projectile Project Detection</a></h2>
<div class="outline-text-2" id="text-orgc84f9c5">
<p>
The relevant documentation is here: <a href="https://docs.projectile.mx/projectile/projects.html#customizing-project-detection">Customizing Project Detection</a>. Projectile
has a few strategies for finding a project root, and it tries each strategy
until one returns a result. The order is defined by this variable:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">projectile-project-root-functions
</pre>
</div>

<table>


<colgroup>
<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">projectile-root-local</td>
</tr>

<tr>
<td class="org-left">projectile-root-marked</td>
</tr>

<tr>
<td class="org-left">projectile-root-bottom-up</td>
</tr>

<tr>
<td class="org-left">projectile-root-top-down</td>
</tr>

<tr>
<td class="org-left">projectile-root-top-down-recurring</td>
</tr>
</tbody>
</table>

<p>
In our example, the function <code>projectile-root-bottom-up</code> is the culprit. We
can try it out interactively:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #000000;">(</span>projectile-root-bottom-up <span style="color: #2544bb;">"/tmp/repo/go/projectA"</span><span style="color: #000000;">)</span>
</pre>
</div>

<div class="results">#+RESULTS:</div><pre class="example">
/tmp/repo/
</pre>


<p>
Yup &#x2013; it found the monorepo, not the subproject. To understand why this is,
let's look at <a href="https://github.com/bbatsov/projectile/blob/271007c6611fcb08ddd326d7de9727c2ad5ef265/projectile.el#L1242-L1251">the source</a>! Here it is:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #000000;">(</span><span style="color: #5317ac;">defun</span> <span style="color: #721045;">projectile-root-bottom-up</span> <span style="color: #a8007f;">(</span>dir <span style="color: #005a5f;">&amp;optional</span> list<span style="color: #a8007f;">)</span>
  <span style="color: #2a486a;">"Identify a project root in DIR by bottom-up search for files in LIST.</span>
<span style="color: #2a486a;">If LIST is nil, use `</span><span style="color: #0000c0;">projectile-project-root-files-bottom-up</span><span style="color: #2a486a;">' instead.</span>
<span style="color: #2a486a;">Return the first (bottommost) matched directory or nil if not found."</span>
  <span style="color: #a8007f;">(</span>projectile-locate-dominating-file
   dir
   <span style="color: #005f88;">(</span><span style="color: #5317ac;">lambda</span> <span style="color: #904200;">(</span>directory<span style="color: #904200;">)</span>
     <span style="color: #904200;">(</span><span style="color: #5317ac;">let</span> <span style="color: #7f10d0;">(</span><span style="color: #006800;">(</span>files <span style="color: #b60000;">(</span>mapcar <span style="color: #1f1fce;">(</span><span style="color: #5317ac;">lambda</span> <span style="color: #605b00;">(</span>file<span style="color: #605b00;">)</span> <span style="color: #605b00;">(</span>expand-file-name file directory<span style="color: #605b00;">)</span><span style="color: #1f1fce;">)</span>
                          <span style="color: #1f1fce;">(</span><span style="color: #5317ac;">or</span> list projectile-project-root-files-bottom-up<span style="color: #1f1fce;">)</span><span style="color: #b60000;">)</span><span style="color: #006800;">)</span><span style="color: #7f10d0;">)</span>
       <span style="color: #7f10d0;">(</span>cl-some <span style="color: #006800;">(</span><span style="color: #5317ac;">lambda</span> <span style="color: #b60000;">(</span>file<span style="color: #b60000;">)</span> <span style="color: #b60000;">(</span><span style="color: #5317ac;">and</span> file <span style="color: #1f1fce;">(</span>file-exists-p file<span style="color: #1f1fce;">)</span><span style="color: #b60000;">)</span><span style="color: #006800;">)</span> files<span style="color: #7f10d0;">)</span><span style="color: #904200;">)</span><span style="color: #005f88;">)</span><span style="color: #a8007f;">)</span><span style="color: #000000;">)</span>
</pre>
</div>

<p>
In regular words, this function starts at the current directory and looks for
any of the marker files in the variable
<code>projectile-project-root-files-bottom-up</code>. If none exist in the current
directory, go up one directory, etc.
</p>

<p>
And what are these "marker files"?
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">projectile-project-root-files-bottom-up
</pre>
</div>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">.git</td>
<td class="org-left">.hg</td>
<td class="org-left">.fslckout</td>
<td class="org-left"><span class="underline">FOSSIL</span></td>
<td class="org-left">.bzr</td>
<td class="org-left">_darcs</td>
<td class="org-left">.pijul</td>
</tr>
</tbody>
</table>

<p>
So, assuming we're somewhere in our monorepo, Projectile starts by looking for
any of those files between the current directory and root.
</p>

<p>
To drive this point home, say we append <code>go.mod</code> to that list of marker files:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #000000;">(</span><span style="color: #5317ac;">setq</span> projectile-project-root-files-bottom-up
      '<span style="color: #a8007f;">(</span><span style="color: #2544bb;">".git"</span> <span style="color: #2544bb;">".hg"</span> <span style="color: #2544bb;">".fslckout"</span>
        <span style="color: #2544bb;">"_FOSSIL_"</span> <span style="color: #2544bb;">".bzr"</span> <span style="color: #2544bb;">"_darcs"</span> <span style="color: #2544bb;">"go.mod"</span><span style="color: #a8007f;">)</span><span style="color: #000000;">)</span>
</pre>
</div>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">.git</td>
<td class="org-left">.hg</td>
<td class="org-left">.fslckout</td>
<td class="org-left"><span class="underline">FOSSIL</span></td>
<td class="org-left">.bzr</td>
<td class="org-left">_darcs</td>
<td class="org-left">go.mod</td>
</tr>
</tbody>
</table>

<p>
Projectile still won't find our Go subproject, because <code>.git</code> comes earlier in
the list of marker files.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #000000;">(</span>projectile-root-bottom-up <span style="color: #2544bb;">"/tmp/repo/go/projectA"</span><span style="color: #000000;">)</span>
</pre>
</div>

<div class="results">#+RESULTS:</div><pre class="example">
/tmp/repo/go/projectA/
</pre>


<p>
That works! So we just need to update
<code>projectile-project-root-files-bottom-up</code>.
</p>
</div>
</div>

<div id="outline-container-org8cc68d2" class="outline-2">
<h2 id="org8cc68d2"><a href="#org8cc68d2">Updating <code>projectile-project-root-files-bottom-up</code></a></h2>
<div class="outline-text-2" id="text-org8cc68d2">
<p>
The problem is:
</p>

<blockquote>
<p>
The variable <code>projectile-project-root-files-bottom-up</code> doesn't have <code>go.mod</code>
or <code>setup.py</code> in it.
</p>
</blockquote>

<p>
We just need to add <code>setup.py</code> and <code>go.mod</code> to the list of marker files.
While we're at it, let's add every other filename that indicates a project
root. Projectile already has a variable for this, documented in <a href="https://docs.projectile.mx/projectile/projects.html#file-markers">File markers</a>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">projectile-project-root-files
</pre>
</div>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">dune-project</td>
<td class="org-left">Project.toml</td>
<td class="org-left">elm.json</td>
<td class="org-left">pubspec.yaml</td>
</tr>

<tr>
<td class="org-left">info.rkt</td>
<td class="org-left">Cargo.toml</td>
<td class="org-left">stack.yaml</td>
<td class="org-left">DESCRIPTION</td>
</tr>

<tr>
<td class="org-left">Eldev</td>
<td class="org-left">Cask</td>
<td class="org-left">shard.yml</td>
<td class="org-left">Gemfile</td>
</tr>

<tr>
<td class="org-left">.bloop</td>
<td class="org-left">deps.edn</td>
<td class="org-left">build.boot</td>
<td class="org-left">project.clj</td>
</tr>

<tr>
<td class="org-left">build.sc</td>
<td class="org-left">build.sbt</td>
<td class="org-left">application.yml</td>
<td class="org-left">gradlew</td>
</tr>

<tr>
<td class="org-left">build.gradle</td>
<td class="org-left">pom.xml</td>
<td class="org-left">pyproject.toml</td>
<td class="org-left">poetry.lock</td>
</tr>

<tr>
<td class="org-left">Pipfile</td>
<td class="org-left">tox.ini</td>
<td class="org-left">setup.py</td>
<td class="org-left">requirements.txt</td>
</tr>

<tr>
<td class="org-left">manage.py</td>
<td class="org-left">angular.json</td>
<td class="org-left">package.json</td>
<td class="org-left">gulpfile.js</td>
</tr>

<tr>
<td class="org-left">Gruntfile.js</td>
<td class="org-left">mix.exs</td>
<td class="org-left">rebar.config</td>
<td class="org-left">composer.json</td>
</tr>

<tr>
<td class="org-left">Taskfile.yml</td>
<td class="org-left">CMakeLists.txt</td>
<td class="org-left">GNUMakefile</td>
<td class="org-left">Makefile</td>
</tr>

<tr>
<td class="org-left">debian/control</td>
<td class="org-left">WORKSPACE</td>
<td class="org-left">flake.nix</td>
<td class="org-left">default.nix</td>
</tr>

<tr>
<td class="org-left">meson.build</td>
<td class="org-left">SConstruct</td>
<td class="org-left">?*.nimble</td>
<td class="org-left">?*.sln</td>
</tr>

<tr>
<td class="org-left">?*.fsproj</td>
<td class="org-left">?*.csproj</td>
<td class="org-left">GTAGS</td>
<td class="org-left">TAGS</td>
</tr>
</tbody>
</table>

<p>
Decent start, but it doesn't have <code>go.mod</code>, so we should add that. Might as
well also add all the files in <code>projectile-project-root-files-bottom-up</code>
(which has <code>.git</code>, etc).
</p>

<p>
So the solution is&#x2026;
</p>
</div>
</div>

<div id="outline-container-solution" class="outline-2">
<h2 id="solution"><a href="#solution">Solution</a></h2>
<div class="outline-text-2" id="text-solution">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #000000;">(</span><span style="color: #5317ac;">setq</span> projectile-project-root-files-bottom-up
  <span style="color: #a8007f;">(</span>-concat
   '<span style="color: #005f88;">(</span><span style="color: #2544bb;">"go.mod"</span><span style="color: #005f88;">)</span>
   projectile-project-root-files-bottom-up
   projectile-project-root-files<span style="color: #a8007f;">)</span><span style="color: #000000;">)</span>
</pre>
</div>

<p>
That creates a pretty complete list of marker files that can indicate project
roots.
</p>
</div>
</div>

<div id="outline-container-orgc95fa59" class="outline-2">
<h2 id="orgc95fa59"><a href="#orgc95fa59">Test</a></h2>
<div class="outline-text-2" id="text-orgc95fa59">
<p>
After setting the variable above, let's see what Projectile says the project
roots are for our monorepo.
</p>
</div>

<div id="outline-container-org320ecfc" class="outline-3">
<h3 id="org320ecfc"><a href="#org320ecfc">Go</a></h3>
<div class="outline-text-3" id="text-org320ecfc">
<p>
Can we correctly identify a Go project?
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #000000;">(</span><span style="color: #5317ac;">let</span> <span style="color: #a8007f;">(</span><span style="color: #005f88;">(</span>default-directory <span style="color: #2544bb;">"/tmp/repo/go/projectA"</span><span style="color: #005f88;">)</span><span style="color: #a8007f;">)</span>
  <span style="color: #a8007f;">(</span>projectile-project-root<span style="color: #a8007f;">)</span><span style="color: #000000;">)</span>
</pre>
</div>

<div class="results">#+RESULTS:</div><pre class="example">
/private/tmp/repo/go/projectA/
</pre>


<p>
✔ Works!
</p>
</div>
</div>

<div id="outline-container-org60dd335" class="outline-3">
<h3 id="org60dd335"><a href="#org60dd335">Python</a></h3>
<div class="outline-text-3" id="text-org60dd335">
<p>
Can we correctly identify a Python project?
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #000000;">(</span><span style="color: #5317ac;">let</span> <span style="color: #a8007f;">(</span><span style="color: #005f88;">(</span>default-directory <span style="color: #2544bb;">"/tmp/repo/python/projectC"</span><span style="color: #005f88;">)</span><span style="color: #a8007f;">)</span>
  <span style="color: #a8007f;">(</span>projectile-project-root<span style="color: #a8007f;">)</span><span style="color: #000000;">)</span>
</pre>
</div>

<div class="results">#+RESULTS:</div><pre class="example">
/private/tmp/repo/python/projectC/
</pre>


<p>
✔ Works!
</p>
</div>
</div>

<div id="outline-container-org1a4aece" class="outline-3">
<h3 id="org1a4aece"><a href="#org1a4aece">Force Root Higher</a></h3>
<div class="outline-text-3" id="text-org1a4aece">
<p>
Can we force the project root to a higher level by creating a <code>.projectile</code>
file?
</p>

<div class="org-src-container">
<pre class="src src-sh">touch /tmp/repo/.projectile
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #000000;">(</span><span style="color: #5317ac;">let</span> <span style="color: #a8007f;">(</span><span style="color: #005f88;">(</span>default-directory <span style="color: #2544bb;">"/tmp/repo/go/projectA"</span><span style="color: #005f88;">)</span><span style="color: #a8007f;">)</span>
  <span style="color: #a8007f;">(</span>projectile-project-root<span style="color: #a8007f;">)</span><span style="color: #000000;">)</span>
</pre>
</div>

<div class="results">#+RESULTS:</div><pre class="example">
/private/tmp/repo/
</pre>


<p>
✔ Works!
</p>
</div>
</div>
</div>
</div>
</body>
</html>